L=[6,3,9,8,2,5,8]

print(len(L)) # یک تابع است
print(sum(L)) # یک تابع است

print(min(L)) #ک تابع است
print(max(L)) #یک تابع است 


print(sorted(L)) # سورتت یک تابع است
print(L)
 
print(L.sort()) # متد سورت
#  فرق متد سورت با تابع سورتت اینه که متد سورت واقعا میره لیست رو تغیر میده
#print(L.sort(L)) # متد سورت چیزی به ما تحویل نمیده و میره لیست رو تغیر میده


print(L.index(8))
print(L.count(8))  #تعداد






# print("--------------------------")
# for index , value in enumerate(L):
#     print(index,value)

#enumerate : اگر برخوردیم به شرایطی که علاوره بر خور مقادیر یک لیست اندیس عا رو هم لازم داشتیم میتونیم از این تابع استفاده بکنیم

print("---------------------------")